app/controllers/menus_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."category" = $1 LIMIT $2  [["category", "appetizers"], ["LIMIT", 1]]
---
  def index
    @recipes = Recipe.all
    @appetizers = Recipe.where(category: "appetizers")