app/controllers/pages_controller.rb

  def home
    @entrees = Recipe.all.where(category: "entre")
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."category" = $1  [["category", "entre"]]