app/controllers/sessions_controller.rb

  def create
    p "@" * 50
    @user = User.find_by_email(params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ap@ap.com"], ["LIMIT", 1]]